let questions = [
    // 0 //
    {
        question: "Вам нравится отечественное программное обеспечение?",
        answers: ["Да!", "Нет..", "Отечественное что?", "Затрудняюсь ответить"]
    },
    // 1 //
    {
        question: "Вы трудны на подъем?",
        answers: ["Да", "Нет", "хз", "Затрудняюсь ответить"]
    },
    // 2 //
    {
        question: "question 3",
        answers: ["ответ 1", "ответ 2", "ответ 3", "Затрудняюсь ответить"]
    },
    // 3 // 
    {
        question: "question 4",
        answers: ["ответ 1", "ответ 2", "ответ 3", "Затрудняюсь ответить"]
    },
    // 4 //
    {
        question: "question 5",
        answers: ["ответ 1", "ответ 2", "ответ 3", "Затрудняюсь ответить"]
    },
    // 5 //
    {
        question: "question 6",
        answers: ["ответ 1", "ответ 2", "ответ 3", "Затрудняюсь ответить"]
    },
    // 6 //
    {
        question: "question 7",
        answers: ["ответ 1", "ответ 2", "ответ 3", "Затрудняюсь ответить"]
    },
    // 7 //
    {
        question: "question 8",
        answers: ["ответ 1", "ответ 2", "ответ 3", "Затрудняюсь ответить"]
    },
    // 8 //
    {
        question: "question 9",
        answers: ["ответ 1", "ответ 2", "ответ 3", "Затрудняюсь ответить"]
    },
    // 9 //
    {
        question: "question 10",
        answers: ["ответ 1", "ответ 2", "ответ 3", "Затрудняюсь ответить"]
    }
]
let results = [
    // 0 //
    {
        result: "вы чайник spacex 1",
        text: "поздравляю",
        wiki: "",
        path: "Images/server-down.jpg"
    },
    // 1 //
    {
        result: "вы чайник spacex 7",
        text: "поздравляю",
        wiki: "",
        path: "Images/server-down.jpg"
    },
    // 2 //
    {
        result: "Вы LDAP сервер!",
        text: "поздравляю",
        wiki: "",
        path: "Images/server-down.jpg"
    },
    // 3 //
    {
        result: "вы чайник spacex 9",
        text: "поздравляю",
        wiki: "",
        path: "Images/db-server-fight.jpg"
    },
    // 4 //
    {
        result: "Вы виртуальный сервер!",
        text: "Поздравляю! Вы обладаете всеми качествами виртуального сервера!",
        wiki: "Для конечных пользователей виртуальный мало чем отличается от физического. Они все также могут хранить там всю необходимую информацию. Однако, с технической точки зрения, благодаря технологии виртуализации информация хранится не на фактическом носителе, вроде винчестеров, а на виртуальном, созданном с использованием мощностей операционной системы и программного обеспечения, установленного на серверном компьютере.",
        path: "Images/VPS.jpg"
    },
    // 5 //
    {
        result: "Atom Reference!?",
        text: "Поздравляю! Вы обнаружили легендарную пасхалку!",
        wiki: "Атом CS2 обязательно выйдет. Прощай AtomCSGO",
        path: "Images/legend2.png"
    }
]